app/channels/application_cable/connection.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
      def find_verified_user
        if verified_user = User.find_by(id: env['warden'].user.id)