app/channels/product_channel.rb

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "messages" ("content", "created_at", "updated_at", "user_id", "product_id") VALUES (?, ?, ?, ?, ?)  [["content", "こんにちは"], ["created_at", "2020-05-07 15:26:41.849500"], ["updated_at", "2020-05-07 15:26:41.849500"], ["user_id", 2], ["product_id", 2]]
---
  def speak(data)
    product = Product.find(params[:product_id])
    Message.create!(content: data['message'], product_id: product.id, user_id: current_user.id)

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def product
    Product.find(params[:product_id])