app/controllers/products_controller.rb

  def index
    if params[:category].nil?
      @products = Product.all.page(params[:page]).per(20)
---
SELECT "products".* FROM "products" ORDER BY "products"."created_at" DESC LIMIT ? OFFSET ?  [["LIMIT", 20], ["OFFSET", 0]]