app/controllers/products_controller.rb

SELECT "products".* FROM "products"
SELECT "products".* FROM "products" WHERE "products"."product_category_id" IN (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
SELECT "product_categories".* FROM "product_categories" WHERE "product_categories"."name" = ? LIMIT ?  [["name", "本"], ["LIMIT", 1]]
SELECT "product_categories".* FROM "product_categories" WHERE "product_categories"."name" IS NULL LIMIT ?  [["LIMIT", 1]]
---
  def index
    if params[:category].nil?
      @products = Product.all
    else
      category = ProductCategory.find_by(category_params)
      @products = Product.where(product_category_id: category.subtree_ids)

      #左上のリンクに使う
      @product_path = category.path.map {|c| c.name}
      @product_children = category.children.map {|c| c.name}

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    if @product = Product.find_by(id: params[:id])

INSERT INTO "products" ("name", "description", "price", "product_image", "created_at", "updated_at", "user_id", "product_category_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @product = current_user.sales_products.build(@product_params)
    if @product.save

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "messages".* FROM "messages" WHERE "messages"."product_id" = ?  [["product_id", 2]]
---
  def speak
    #message type に合ったmessageをviewに渡す
    @product = Product.find(params[:id])
    if params[:message_type] == 'q_and_a'
      @messages = QAndAMessage.where(product_id: @product.id)