app/controllers/product_categories_controller.rb

SELECT "product_categories".* FROM "product_categories" WHERE "product_categories"."name" = ? LIMIT ?  [["name", "本"], ["LIMIT", 1]]
---
  def category
    p = ProductCategory.find_by(name: params[:category_name])